{
    "fullName": "YichunQu",
    "contacts": [
        {
            "type": "EMAIL",
            "contact": "qyc11@hotmail.com"
        },
        {
            "type": "PHONE",
            "contact": "+8618964858957"
        }
    ],
    "educations": [
        {
            "startDate": "2016-08-01",
            "endDate": "2017-05-01",
            "collegeName": "TheUniversityofTexasatDallas(\\W{0,2}NaveenJindalSchoolofManagement)?",
            "degreeLevel": "MASTER",
            "majorName": "Information Technology and Management"
        },
        {
            "startDate": "2014-09-01",
            "endDate": "2016-08-01",
            "collegeName": "(ShanghaiJiaoTongUniversity)|(TheUniversityofTexasatDallas(\\W{0,2}NaveenJindalSchoolofManagement)?)",
            "degreeLevel": "MASTER",
            "majorName": "Finance"
        },
        {
            "startDate": "2010-09-01",
            "endDate": "2014-06-01",
            "collegeName": "ShanghaiUniversityofInternationalBusinessandEconomics",
            "degreeLevel": "BACHELOR",
            "majorName": "English"
        }
    ],
    "experiences": [
        {
            "description": "Work with business stakeholders to translate business requirement into functional requirement.\\W*Set up the Power BI database, design and develop all the custom metrics, reports and dashboards in Power BI to meet functional\\W*requirements for the whole operation department by cooperating with IT team in Spain.\\W*Clarify end user’s inquiry on reports’ features and functionalities, continuously optimize reports along with the developing\noperating procedure.\\W*Collect and consolidate data from different portals to prepare monthly and quarterly operational reports for upper management to\\W*track enterprise level KPI.\\W*Conduct analytical projects on massive datasets with tableau to analyze system operational constraints, deficiencies and defects,\\W*collaborate with operation team and tech team to develop solutions.\\W*Monitor and report on accurate transaction generation at the roadside, timely data transmission, data validation of transaction,\\W*track and analyze system performance and operation performance.\\W*Participate in the implementation and testing of Central Systems, track results and records and escalate system performance issues.",
            "companyName": "I\\W{0,2}77MobilityPartners(LLC)?(\\W{0,2}CintraUS(\\W{0,2}Ferrovial)?)?",
            "title": "Operation Data Analyst",
            "startDate": "2018-07-01",
            "endDate": "2021-04-01"
        },
        {
            "description": "Extracted data from CRM system, created monthly reports based on different key performance indicators including customer\\W*complaint code, complaint over 60 days and average complaint solving days.\\W*Created and compared charts, tables and graphs, identified trends and occurrences.\\W*Prepared advanced shipping notice by using electronic data interchange system, maintained data integrity of inventory system by\\W*trouble shooting between Redtail and Microsoft GP.\\W*Searched, extracted, managed and analyzed data in Microsoft Dynamics Great Plains system to support daily business process\\W*and annual auditing.",
            "companyName": "ProdigyDiabetesCare(LLC)?",
            "title": "Data and Billing Analyst",
            "startDate": "2017-10-01",
            "endDate": "2018-06-01"
        },
        {
            "description": "Performed ad-hoc reports of beauty advisors’ basic information for training and sales department.\\W*Created monthly, quarterly, and yearly coaching reports for more than 200 beauty advisors from the whole China department\\W*and presented it in PowerPoint in department meetings to improve beauty advisors’ selling skills.\\W*Troubleshooted and analyzed reports using Excel (V lookup, pivot tables) to follow up beauty advisors’ performance every\\W*season, helped training department to achieve higher efficiency on training beauty advisors’ selling skills by 15%.\\W*Tracked and analyzed actual product using and ordering on a monthly basis, forecasted second year product ordering based on\\W*the purchase price variance and budget variance.\\W*Supported the creation of key door action plan, provided insight into the establishment of SKU sales target of each beauty\\W*advisor.",
            "companyName": "(LVMH)?Perfumes\\W{0,2}Cosmetics(Company(Limited)?)?",
            "title": "FRESH Training Department Business Analyst Intern",
            "startDate": "2014-01-01",
            "endDate": "2015-06-01"
        }
    ],
    "skills": [
        {
            "skillName": "SQL"
        },
        {
            "skillName": "Tableau"
        },
        {
            "skillName": "Python"
        }
    ]
}