{
    "fullName": "Chris  Huang",
    "contacts": [
        {
            "contact": "kuoweism@gmail.com",
            "type": "EMAIL"
        },
        {
            "contact": "+18583973943",
            "type": "PHONE"
        }
    ],
    "currentLocation": [
        {
            "location": "41450 Culpepper Way, Leonardtown, MD 20650, USA"
        }
    ],
    "languages": [
        "English"
    ],
    "educations": [
        {
            "endDate": "2021-03-01",
            "majorName": "Defense Acquisition University Engineering II Certification"
        },
        {
            "endDate": "2002-06-01",
            "collegeName": "University of California",
            "majorName": "M.S. in Engineering & Applied Science – Communications"
        },
        {
            "endDate": "1999-06-01",
            "collegeName": "University of California",
            "degreeLevel": "bachelors",
            "majorName": "Bachelor of Science"
        }
    ],
    "experiences": [
        {
            "description": " Support PMA-209 for Modular Open System Architecture (MOSA) realization at NAVAIR on MQ-25, FVL, E-XX, NGAD platforms. \n•Serve as the NAVAIR RE/SME in guiding program offices in building Model Based Open Architecture models; chair NAVAIR Digital Transformation Data Modeling COP TIM. \n•Research SysML v2 and API framework for model consistency, interoperability and re usability; draft Model Maturity Whitepaper with Georgia Tech over an awarded S&T fund. ",
            "companyName": "NAVAIR",
            "title": "Platform Integration & Modeling Lead Engineer",
            "startDate": "2020-10-01",
            "endDate": "2022-12-21",
            "current": true
        },
        {
            "description": " Served as the NG Aeronautics Systems scrum master NGIDE team on MBSE digital engineering initiative in developing Methodology, Process, Templates, Reference Models, Profiles, Checklist, Style Guide, Model Maturity Metrics for internal programs usage. \n•Supported Global Hawks Modernization contract execution with AI image processing customization; GBSD on software modeling; NGAD MDAO design integration. \n•Experience with UAF DoDAF frameworks, SysML, UML, LML, OMS, DDS, Model Maturity and Metrics, system to software model transition; Cameo and Rhapsody tools. ",
            "companyName": "Northrop Grumman",
            "title": "Staff Engineer",
            "startDate": "2019-03-01",
            "endDate": "2020-10-01"
        },
        {
            "description": " MBSE support of: weapon systems (SSDS ICS & AEGIS), ships (DDG & CVN) and networks (NGEN & JWICS); research AOA, defined & synthesized requirements; planned and coordinated model development efforts. \n•Served as a member of the NMCI Cyber Security Tiger Team in assessing and reviewing security features and solutions on endpoints, networks, servers and services/processes, as well as identifying data for analysis. \n•Performed data analytics, model design and creation of SysML/DoDAF models; led internal development team on Cameo tool capabilities development; outlined Model as a Service solution for network consolidation; supported NGEN Transformation modeling effort. ",
            "companyName": "Naval Information Warfare Center",
            "title": "Lead Engineer",
            "startDate": "2018-04-01",
            "endDate": "2019-02-01"
        },
        {
            "description": " Piloted MBSE system methodology in support of DRM cryptographic security system life cycle from definition to validation; o Created MBSE models in support of design analysis, with simulations to show how messages are coordinated, and keys are staying in sync. o Developed expert knowledge on PKI, federated identity and access management; patent submitted on Self Provisioning. \n•Performed MBSE modeling in SysML on MediaCipher Conditional Access system and DTA Encryption Infrastructure for video content protection over cable; o Demonstrated the security of the systems using model, resulted in certification to deliver high value content (new release theater graded movies) to settops. o Participated in Comcast Big Data Analytics as the access network lead in data manicuring, data analysis, supervised learning algorithm tuning. \n•Served as the subject matter expert in System Engineering over Agile development process by trial the processes to Key Server and embedded security client projects; o Developed SysML-based models that include use cases, activity, architectures, components, sequences, states, classes and requirements diagrams. o Led SW (Java) development of Linux based Key Server in cloud microservice (Kubernetes) with intelligent network health monitoring system. ",
            "companyName": "COMCAST CABLE",
            "title": "Senior Staff Systems Engineer",
            "startDate": "2006-04-01",
            "endDate": "2018-02-01"
        },
        {
            "description": " Led software development of industry first microwave transceiver remote monitor unit with embedded SNMP and TCP/IP protocols in C for Boeing Video Surveillance System. \n•Performed network simulation (Opnet), link budget propagation and coverage analysis, create system design prototypes for network layer requirement and performance analysis. \n•Awarded patent: \"Device and Method for Sharpening Image Signal\" # 20070070428. ",
            "companyName": "Cable AML",
            "title": "Software Engineer",
            "startDate": "2002-06-01",
            "endDate": "2006-04-01"
        }
    ],
    "skills": [
        {
            "skillName": "Image Processing"
        },
        {
            "skillName": "Information Warfare"
        },
        {
            "skillName": "Application Programming Interface (API)"
        },
        {
            "skillName": "Agile Software Development"
        },
        {
            "skillName": "Usability"
        },
        {
            "skillName": "Integration"
        },
        {
            "skillName": "Digital Transformation"
        },
        {
            "skillName": "Research"
        },
        {
            "skillName": "Big Data"
        },
        {
            "skillName": "DoDAF"
        },
        {
            "skillName": "Transceiver"
        },
        {
            "skillName": "Security Systems"
        },
        {
            "skillName": "Simulations"
        },
        {
            "skillName": "Infrastructure"
        },
        {
            "skillName": "Data Analysis"
        },
        {
            "skillName": "Data Modeling"
        },
        {
            "skillName": "Analytics"
        },
        {
            "skillName": "Network Simulation"
        },
        {
            "skillName": "Management"
        },
        {
            "skillName": "Software Development"
        },
        {
            "skillName": "Open Systems Architecture"
        },
        {
            "skillName": "Linux"
        },
        {
            "skillName": "Java (Programming Language)"
        },
        {
            "skillName": "Supervised Learning"
        },
        {
            "skillName": "Scrum (Software Development)"
        },
        {
            "skillName": "Cyber Security"
        },
        {
            "skillName": "System Software"
        },
        {
            "skillName": "Kubernetes"
        },
        {
            "skillName": "Draft (Boiler)"
        },
        {
            "skillName": "Systems Engineering"
        },
        {
            "skillName": "Templates"
        },
        {
            "skillName": "Network Layer"
        },
        {
            "skillName": "Encryption"
        },
        {
            "skillName": "Access Network"
        },
        {
            "skillName": "Top Secret Clearance"
        },
        {
            "skillName": "Sharpening"
        },
        {
            "skillName": "Experience Design"
        },
        {
            "skillName": "Interoperability"
        },
        {
            "skillName": "Secret Clearance"
        },
        {
            "skillName": "Link Budget"
        },
        {
            "skillName": "Consolidation"
        },
        {
            "skillName": "Transformation (Genetics)"
        },
        {
            "skillName": "TCP/IP"
        }
    ]
}