{
    "fullName": "SHU TING HUANG",
    "contacts": [],
    "educations": [
        {
            "startDate": "2014-03-01",
            "endDate": "2015-00-01",
            "collegeName": "Royal College of Art",
            "majorName": "Innovation Design Engineering"
        }
    ],
    "experiences": [
        {
            "description": "Attending Fab10 Barcelona and Fab11 Boston (MIT) as a member\nInteraction Designer, Emotech Ltd.; London, UK\nof FabLab Dynamic, Taipei, Taiwan.\nspecialised in interaction design -\npassionate about emerging Human-centred design is the key to give Emotech’s products Participated in btk International Summer School Design, Art and\nspirit. As an interaction designer, I am responsible for envisioning\ntechnology, digital art, and human and executing the interaction between people and robot in the\nCultural workshop- Filmmaking in Berlin. I learned documentary\nfilmmaking and made three experimental videos during the\ncomputer interaction. I have future home scenario, assessing product requirements (costs, summer school. It was instructed by Anna Marziano and Armin\ntraveled across Asia, America, and manufacturing feasibility and market requirements, etc.); doing Dierolf.\ncomplex tasks related to artificial intelligence and collaborating\nEurope gaining insights into diverse with our machine learning scientists, researchers and developers;\nParticipated in an international worksho - Social Design, hosted\ncultures, and the way industrial\ngaining experience working with a multi-disciplinary team. by \"Fablab annual meeting in Taiwa - Open Fab City\" and\ndesign is practiced in daily activities instructed by Anna Waldman-Brown.\n7/- 8/2016\nand among humans.\nDesign Thinker, Satellite Applications Catapult; Oxfordshire, UK\nSKILLS\nAn 8-week internship working in the design team to understand\nAs a designer, I found the gaps\nusers and social impact of space technology. This is part of the Sofware\nUX\nbetween human and artificial\nSpace Placements in INdustry (SPIN) scheme, which is managed\nAdobe Illustrator Wireframe\nintelligence laid wonderful by the Institute for Environmental Analytics at the University of\nReading and supported by the Satellite Applications Catapult and Adobe Photoshop\nInteractive Prototype\nopportunities for exploration and\nthe UK Space Agency.\nnew ideas.\nAdobe After Effects UX Research",
            "companyName": "I am a creative technologist",
            "title": "Interaction Designer, Emotech Ltd.; London, UK",
            "startDate": "2017-04-01",
            "current": true
        },
        {
            "description": "Sketch Persona\nCommissioned by the company as a contract designer to design its Final Cut Pro\nUsability Test\nMACHINE CREATIVITY\n+\nIPO presentation materials, including understanding and Autodesk Alias\nUser Story\nAUGMENTED REALITY visualising the company’s value proposition, as well as its products\nKeyshot\n(long-acting analgesic injection and small molecule for the acute\nAnalog Fabrication\nischemic stroke treatment). Cinema 4D\nWood Workshop\nUnity",
            "companyName": "Designer, Lumosa Therapeutics co. Ltd.; Taipei, Taiwan",
            "title": "RESEARCH FOCUS",
            "startDate": "2015-04-01",
            "endDate": "2015-07-01"
        }
    ],
    "skills": [
        {
            "skillName": "Adobe"
        },
        {
            "skillName": "Unity"
        },
        {
            "skillName": "Sketch"
        },
        {
            "skillName": "Python"
        },
        {
            "skillName": "Network"
        },
        {
            "skillName": "English"
        },
        {
            "skillName": "Keyshot"
        },
        {
            "skillName": "Chinese"
        },
        {
            "skillName": "Designer"
        },
        {
            "skillName": "Autodesk"
        },
        {
            "skillName": "Exchange"
        },
        {
            "skillName": "HTML/CSS"
        },
        {
            "skillName": "JavaScript"
        },
        {
            "skillName": "Tensorflow"
        },
        {
            "skillName": "Presentation"
        },
        {
            "skillName": "Final Cut Pro"
        },
        {
            "skillName": "Adobe Photoshop"
        },
        {
            "skillName": "Adobe Illustrator"
        },
        {
            "skillName": "Project Management"
        },
        {
            "skillName": "Adobe After Effects"
        }
    ]
}